Revit 2026 API

# DimensionTypeCanHaveEqualityFormula Method

---

Checks whether this DimensionType can have an equality formula.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanHaveEqualityFormula()
```
```vb
Public Function CanHaveEqualityFormula As Boolean
```
```cpp
public:
bool CanHaveEqualityFormula()
```
```fsharp
member CanHaveEqualityFormula : unit -> bool
```

#### Return Value

Boolean True when the DimensionType is continuous linear or angular, false otherwise

Equality formulas can be used for continuous linear or angular dimension types.

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace